Copyright Jana Schaich Borg/Attribution-NonCommercial 4.0 International (CC BY-NC 4.0)

# MySQL Exercise 2: Using WHERE to select specific data

In [1]:
# load the SQL library, and connect to it
%load_ext sql
%sql mysql://studentuser:studentpw@mysqlserver/dognitiondb
%sql USE dognitiondb

0 rows affected.

[]

In [2]:
%%sql
SELECT user_guid, free_start_user # show two columns
FROM users # from users table
WHERE free_start_user=1 # select the data that the value in the "free_start_user" column is 1
LIMIT 10; # show first 10 rows

10 rows affected.

[('ce28a468-7144-11e5-ba71-058fbc01cf0b', 1),
 ('ce28ac4c-7144-11e5-ba71-058fbc01cf0b', 1),
 ('ce28acba-7144-11e5-ba71-058fbc01cf0b', 1),
 ('ce28ad1e-7144-11e5-ba71-058fbc01cf0b', 1),
 ('ce28ad82-7144-11e5-ba71-058fbc01cf0b', 1),
 ('ce28b098-7144-11e5-ba71-058fbc01cf0b', 1),
 ('ce28b1c4-7144-11e5-ba71-058fbc01cf0b', 1),
 ('ce28b58e-7144-11e5-ba71-058fbc01cf0b', 1),
 ('ce28b9bc-7144-11e5-ba71-058fbc01cf0b', 1),
 ('ce28ba20-7144-11e5-ba71-058fbc01cf0b', 1)]

### Most common operators include: =,<,>,<=, and >=.  If you want to select something that is NOT a specific value, use != or <>.  You can also use logical operators, such as AND and OR.

Let's start by examining how operators can be used with numerical data.

```mySQL
SELECT dog_guid, weight
FROM dogs
WHERE weight BETWEEN 10 AND 50
WHERE dog_fixed=1 OR dna_tested=1
WHERE dog_fixed=1 AND dna_tested!=1;
```

In [7]:
%%sql
SELECT dog_guid, weight
FROM dogs
WHERE weight BETWEEN 10 AND 50 # select Dog IDs who weighed between 10 and 50 (pounds)
LIMIT 5;

5 rows affected.

[('fd27b272-7144-11e5-ba71-058fbc01cf0b', 50),
 ('fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 20),
 ('fd27bbbe-7144-11e5-ba71-058fbc01cf0b', 50),
 ('fd27c74e-7144-11e5-ba71-058fbc01cf0b', 40),
 ('fd27c852-7144-11e5-ba71-058fbc01cf0b', 20)]

In [8]:
%%sql
SELECT dog_guid, dog_fixed, dna_tested
FROM dogs
WHERE dog_fixed=1 OR dna_tested=1 # select Dog IDs who were "fixed" OR DNA tested
LIMIT 5;

5 rows affected.

[('fd27b272-7144-11e5-ba71-058fbc01cf0b', 1, 0),
 ('fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 1, 0),
 ('fd27b6b4-7144-11e5-ba71-058fbc01cf0b', 0, 1),
 ('fd27b948-7144-11e5-ba71-058fbc01cf0b', 1, 0),
 ('fd27ba1a-7144-11e5-ba71-058fbc01cf0b', 1, 0)]

In [9]:
%%sql
SELECT dog_guid, dog_fixed, dna_tested
FROM dogs
WHERE dog_fixed=1 AND dna_tested!=1 # select Dog IDs who were fixed but NOT DNA tested
LIMIT 5;

5 rows affected.

[('fd27b272-7144-11e5-ba71-058fbc01cf0b', 1, 0),
 ('fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 1, 0),
 ('fd27b948-7144-11e5-ba71-058fbc01cf0b', 1, 0),
 ('fd27ba1a-7144-11e5-ba71-058fbc01cf0b', 1, 0),
 ('fd27bbbe-7144-11e5-ba71-058fbc01cf0b', 1, 0)]

### WHERE statement to interact with text data (called "strings").
 
(note that double quotation marks could have been used in this example is well):
```mySQL
SELECT dog_guid, breed
FROM dogs
WHERE breed='golden retriever';
```

The IN operator allows you to specify multiple values in a WHERE clause (note that single quotation marks could have been used in this example, too):

```mySQL
SELECT dog_guid, breed
FROM dogs
WHERE breed IN ("golden retriever","poodle");
```

The LIKE operator allows you to specify a pattern that the textual data you query has to match.  For example, if you wanted to look at all the data from breeds whose names started with "s", you could query:

```mySQL
SELECT dog_guid, breed
FROM dogs
WHERE breed LIKE ("s%");
```

In this syntax, the percent sign indicates a wild card.  Wild cards represent unlimited numbers of missing letters.  This is how the placement of the percent sign would affect the results of the query:

+ WHERE breed LIKE ("s%") = the breed must start with "s", but can have any number of letters after the "s"
+ WHERE breed LIKE ("%s") = the breed must end with "s", but can have any number of letters before the "s"
+ WHERE breed LIKE ("%s%") = the breed must contain an "s" somewhere in its name, but can have any number of letters before or after the "s"

In [10]:
%%sql
SELECT dog_guid, breed
FROM dogs
WHERE breed='golden retriever' # select the breed is 'golden retriever'
LIMIT 5;

5 rows affected.

[('fd27b6b4-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever'),
 ('fd27b79a-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever'),
 ('fd27efb2-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever'),
 ('fd3d03fc-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever'),
 ('fd3d10cc-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever')]

In [14]:
%%sql
SELECT dog_guid, breed
FROM dogs
WHERE breed IN ("golden retriever","poodle") # select both breed 'golden retriever' and breed 'poodle'
LIMIT 5;

5 rows affected.

[('fd27b6b4-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever'),
 ('fd27b79a-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever'),
 ('fd27d144-7144-11e5-ba71-058fbc01cf0b', 'Poodle'),
 ('fd27d1c6-7144-11e5-ba71-058fbc01cf0b', 'Poodle'),
 ('fd27efb2-7144-11e5-ba71-058fbc01cf0b', 'Golden Retriever')]

In [13]:
%%sql
SELECT dog_guid, breed
FROM dogs
WHERE breed LIKE ("s%") # select all the data from breeds whose names started with "s"
LIMIT 5;

5 rows affected.

[('fd27b5ba-7144-11e5-ba71-058fbc01cf0b', 'Shetland Sheepdog'),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b', 'Shih Tzu'),
 ('fd27b948-7144-11e5-ba71-058fbc01cf0b', 'Siberian Husky'),
 ('fd27ba1a-7144-11e5-ba71-058fbc01cf0b', 'Shih Tzu'),
 ('fd27c5be-7144-11e5-ba71-058fbc01cf0b', 'Shih Tzu-Poodle Mix')]

### Using the WHERE statement to interact with datetime data. 

DATE - format YYYY-MM-DD  
DATETIME - format: YYYY-MM-DD HH:MI:SS  
TIMESTAMP - format: YYYY-MM-DD HH:MI:SS  
YEAR - format YYYY or YY
 
If you want to find the difference in time between two time stamps or dates, you would use the TIMEDIFF or DATEDIFF function.

In [15]:
%%sql
SELECT dog_guid, created_at
FROM complete_tests
LIMIT 5;

5 rows affected.

[('fd27b86c-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 5, 18, 26, 54)),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 5, 18, 31, 3)),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 5, 18, 32, 4)),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 5, 18, 32, 25)),
 ('fd27b86c-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 5, 18, 32, 56))]

In [17]:
%%sql
SELECT dog_guid, created_at
FROM complete_tests
WHERE DAYNAME(created_at)="Friday" # DAYNAME will convert the time stamps to the day of the week for that date
LIMIT 5;

5 rows affected.

[('fd27c5be-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 8, 0, 52, 45)),
 ('fd27c5be-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 8, 0, 57, 29)),
 ('fd27c8d4-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 8, 0, 59, 17)),
 ('fd27c5be-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 8, 1, 2, 17)),
 ('fd27c8d4-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 8, 1, 3, 27))]

In [18]:
%%sql
SELECT dog_guid, created_at
FROM complete_tests
WHERE DAY(created_at) > 15 # select the data after after the 15 of every month
LIMIT 5;

5 rows affected.

[('fd3f8aa0-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 16, 0, 14, 42)),
 ('fd3f8aa0-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 16, 0, 16, 36)),
 ('fd3f8aa0-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 16, 0, 16, 29)),
 ('fd3f8aa0-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 16, 0, 17)),
 ('fd3f8aa0-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2013, 2, 16, 0, 17, 25))]

In [19]:
%%sql
SELECT dog_guid, created_at
FROM complete_tests
WHERE created_at > '2014-02-04' # select data after February 4, 2014 by treating date entries as text 
LIMIT 5;

5 rows affected.

[('fd5c359c-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2014, 2, 4, 0, 23, 31)),
 ('fd5c359c-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2014, 2, 4, 0, 26, 49)),
 ('fd5c359c-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2014, 2, 4, 0, 28, 22)),
 ('fd5c359c-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2014, 2, 4, 0, 31, 54)),
 ('fd5c359c-7144-11e5-ba71-058fbc01cf0b', datetime.datetime(2014, 2, 4, 0, 42, 37))]

### Use the WHERE statement in combination with IS NULL and IS NOT NULL.  IS NULL will indicate rows of data that have null values.  IS NOT NULL will indicate rows that do not have null values.

In [21]:
%%sql
SELECT user_guid, free_start_user
FROM users
WHERE free_start_user IS NOT NULL # select rows that have non-null data in this column, 0 is not null
LIMIT 5;

5 rows affected.

[('ce135e14-7144-11e5-ba71-058fbc01cf0b', 0),
 ('ce135e14-7144-11e5-ba71-058fbc01cf0b', 0),
 ('ce136a1c-7144-11e5-ba71-058fbc01cf0b', 0),
 ('ce135e14-7144-11e5-ba71-058fbc01cf0b', 0),
 ('ce135e14-7144-11e5-ba71-058fbc01cf0b', 0)]

In [22]:
%%sql
SELECT user_guid, free_start_user
FROM users
WHERE free_start_user IS NULL # select rows that have null data in this column
LIMIT 5;

5 rows affected.

[('ce134e42-7144-11e5-ba71-058fbc01cf0b', None),
 ('ce1353d8-7144-11e5-ba71-058fbc01cf0b', None),
 ('ce135ab8-7144-11e5-ba71-058fbc01cf0b', None),
 ('ce13507c-7144-11e5-ba71-058fbc01cf0b', None),
 ('ce13615c-7144-11e5-ba71-058fbc01cf0b', None)]

## Practice writing your own SELECT and WHERE statements!

### These queries will combine what you've learned in the past two lessons.

**Question 1: How would you retrieve the Dog ID, subcategory_name, and test_name fields, in that order, of the first 10 reviews entered in the Reviews table to be submitted in 2014?**

In [23]:
%%sql
SELECT dog_guid, subcategory_name, test_name
FROM reviews
WHERE YEAR(created_at) = 2014
LIMIT 10;

10 rows affected.

[('ce3ac77e-7144-11e5-ba71-058fbc01cf0b', 'Empathy', 'Yawn Warm-up'),
 ('ce2aedcc-7144-11e5-ba71-058fbc01cf0b', 'Empathy', 'Eye Contact Warm-up'),
 ('ce2aedcc-7144-11e5-ba71-058fbc01cf0b', 'Empathy', 'Eye Contact Game'),
 ('ce2aedcc-7144-11e5-ba71-058fbc01cf0b', 'Communication', 'Treat Warm-up'),
 ('ce405c52-7144-11e5-ba71-058fbc01cf0b', 'Empathy', 'Yawn Warm-up'),
 ('ce405c52-7144-11e5-ba71-058fbc01cf0b', 'Empathy', 'Yawn Game'),
 ('ce405c52-7144-11e5-ba71-058fbc01cf0b', 'Empathy', 'Eye Contact Game'),
 ('ce405e28-7144-11e5-ba71-058fbc01cf0b', 'Communication', 'Treat Warm-up'),
 ('ce405e28-7144-11e5-ba71-058fbc01cf0b', 'Cunning', 'Turn Your Back'),
 ('ce2609c4-7144-11e5-ba71-058fbc01cf0b', 'Communication', 'Treat Warm-up')]

** Question 2: How would you select all of the User IDs of customers who have female dogs whose breed includes the word "terrier" somewhere in its name (if you don't limit your output, you should have 1771 rows in your output)? **

In [25]:
%%sql
SELECT user_guid, breed, gender 
FROM dogs
WHERE breed LIKE ("%terrier%") AND gender='female'
LIMIT 5;

5 rows affected.

[('ce138722-7144-11e5-ba71-058fbc01cf0b', 'Australian Terrier', 'female'),
 ('ce13b152-7144-11e5-ba71-058fbc01cf0b', 'Bedlington Terrier', 'female'),
 ('ce21d7d2-7144-11e5-ba71-058fbc01cf0b', 'Russell Terrier', 'female'),
 ('ce2202e8-7144-11e5-ba71-058fbc01cf0b', 'Boston Terrier-Chihuahua Mix', 'female'),
 ('ce2203f6-7144-11e5-ba71-058fbc01cf0b', 'American Pit Bull Terrier', 'female')]

**Question 3: How would you select the Dog ID, test name, and subcategory associated with each completed test for the first 10 tests entered in October, 2014?**

In [27]:
%%sql
SELECT dog_guid, test_name, subcategory_name, created_at
FROM complete_tests
WHERE YEAR(created_at)=2014 AND MONTH(created_at)=10 # the time (hour: minute: second) is in order itself
LIMIT 10;

10 rows affected.

[('fd6a3480-7144-11e5-ba71-058fbc01cf0b', 'Delayed Cup Game', 'Memory', datetime.datetime(2014, 10, 1, 0, 0, 54)),
 ('fd6a3480-7144-11e5-ba71-058fbc01cf0b', 'Inferential Reasoning Warm-up', 'Reasoning', datetime.datetime(2014, 10, 1, 0, 14, 58)),
 ('fd6a3480-7144-11e5-ba71-058fbc01cf0b', 'Inferential Reasoning Game', 'Reasoning', datetime.datetime(2014, 10, 1, 0, 21, 33)),
 ('fd6a3480-7144-11e5-ba71-058fbc01cf0b', 'Physical Reasoning Warm-up', 'Reasoning', datetime.datetime(2014, 10, 1, 0, 29, 37)),
 ('fd6a3480-7144-11e5-ba71-058fbc01cf0b', 'Physical Reasoning Game', 'Reasoning', datetime.datetime(2014, 10, 1, 0, 34, 30)),
 ('fd6a2350-7144-11e5-ba71-058fbc01cf0b', 'Memory versus Smell', 'Memory', datetime.datetime(2014, 10, 1, 0, 37, 58)),
 ('fd6924aa-7144-11e5-ba71-058fbc01cf0b', 'Yawn Warm-up', 'Empathy', datetime.datetime(2014, 10, 1, 0, 47, 54)),
 ('fd6924aa-7144-11e5-ba71-058fbc01cf0b', 'Yawn Game', 'Empathy', datetime.datetime(2014, 10, 1, 0, 52, 31)),
 ('fd6924aa-7144-11e5-ba71-058fbc01cf0b', 'Eye Contact Warm-up', 'Empathy', datetime.datetime(2014, 10, 1, 0, 53, 36)),
 ('fd6924aa-7144-11e5-ba71-058fbc01cf0b', 'Eye Contact Game', 'Empathy', datetime.datetime(2014, 10, 1, 0, 59, 47))]

There are many more operators you can use in your WHERE clauses to restrict the data you select as well.  We do not have the space to go over each one individually in this lesson, but I encourage you to explore them on your own.  <mark>*This is a great area to practice being fearless and bold in your desire to learn new things!  The more you try, the more you will learn.*</mark>  

**Feel free to practice any other functions or operators you discover in the space below:**